[
    {
        "name": "Bodyweight Squats",
        "description": "Stand with feet shoulder-width apart, chest up. Lower your hips as if sitting into a chair, keeping your back straight and knees tracking over your toes. Go as deep as comfortable, then return to start.",
        "reps": 12,
        "sets": 3
    },
    {
        "name": "Push-ups",
        "description": "Start in a plank position with hands slightly wider than shoulder-width. Lower your chest towards the floor, keeping your body in a straight line from head to heels. Push back up. Modify on knees if needed.",
        "reps": 10,
        "sets": 3
    },
    {
        "name": "Reverse Lunges (Alternating Legs)",
        "description": "Stand tall. Step one leg back, lowering your hips until both knees are bent at a 90-degree angle. Ensure your front knee is over your ankle. Push off the back foot to return to standing, then alternate legs.",
        "reps": 10,
        "sets": 3
    },
    {
        "name": "Plank",
        "description": "Start on your forearms and toes, keeping your body in a straight line from head to heels. Engage your core, glutes, and quads to prevent your hips from sagging or rising too high. Hold this position for 45-60 seconds.",
        "reps": 45,
        "sets": 3
    },
    {
        "name": "Glute Bridges",
        "description": "Lie on your back with knees bent, feet flat on the floor close to your glutes. Lift your hips off the floor until your body forms a straight line from your shoulders to your knees. Squeeze your glutes at the top, then lower slowly.",
        "reps": 15,
        "sets": 3
    },
    {
        "name": "Crunches",
        "description": "Lie on your back with knees bent and feet flat on the floor. Place hands lightly behind your head or across your chest. Lift your upper body towards your knees, engaging your abdominal muscles. Lower with control.",
        "reps": 15,
        "sets": 3
    },
    {
        "name": "Superman",
        "description": "Lie face down with arms extended forward and legs straight. Simultaneously lift your arms, chest, and legs off the floor, engaging your back and glutes. Hold briefly, then lower with control.",
        "reps": 12,
        "sets": 3
    }
]